benchmarks/definitive_results/background/opt-1.3b/_384_/log_15832421.out
WARNING 02-19 15:22:11 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', host='localhost', port=54689, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/definitive_results/background/opt/opt-1.3b/_384_', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b --max-model-len=2048 --max-num-seqs=384', multiple_servers=1, launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Servers started
Requests to servers. Values: ['http://localhost:54689/v1/completions']. Counts: [2000]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  72.32     
Total input tokens:                      221292    
Total generated tokens:                  584712    
Request throughput (req/s):              27.65     
Output token throughput (tok/s):         8084.77   
Total Token throughput (tok/s):          11144.55  
---------------Time to First Token----------------
Mean TTFT (ms):                          22925.52  
Median TTFT (ms):                        20998.77  
P99 TTFT (ms):                           55872.77  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.03     
Median TPOT (ms):                        43.91     
P99 TPOT (ms):                           62.61     
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.88     
Median ITL (ms):                         33.49     
P99 ITL (ms):                            278.38    
==================================================
Concurrent checkers terminated
Servers terminated